# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + GAM (Global Attention Module) v8
# P2 detection head + ATT only at P2,P3 backbone + P2,P3 neck output (4 blocks)
# Focused on small object detection scales

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, GAM, [4]]               # 3 ← after C2f P2
  - [-1, 1, Conv, [256, 3, 2]]      # 4-P3/8
  - [-1, 6, C2f, [256, True]]       # 5
  - [-1, 1, GAM, [4]]               # 6 ← after C2f P3
  - [-1, 1, Conv, [512, 3, 2]]      # 7-P4/16
  - [-1, 6, C2f, [512, True]]       # 8
  - [-1, 1, Conv, [1024, 3, 2]]     # 9-P5/32
  - [-1, 3, C2f, [1024, True]]      # 10
  - [-1, 1, SPPF, [1024, 5]]        # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 8], 1, Concat, [1]]       # 13 cat backbone P4
  - [-1, 3, C2f, [512]]             # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 6], 1, Concat, [1]]       # 16 cat backbone P3
  - [-1, 3, C2f, [256]]             # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 3], 1, Concat, [1]]       # 19 cat backbone P2
  - [-1, 3, C2f, [128]]             # 20 (P2/4-tiny)
  - [-1, 1, GAM, [4]]               # 21 ← after C2f neck P2

  - [-1, 1, Conv, [128, 3, 2]]      # 22
  - [[-1, 17], 1, Concat, [1]]      # 23 cat neck P3
  - [-1, 3, C2f, [256]]             # 24 (P3/8-small)
  - [-1, 1, GAM, [4]]               # 25 ← after C2f neck P3 output

  - [-1, 1, Conv, [256, 3, 2]]      # 26
  - [[-1, 14], 1, Concat, [1]]      # 27 cat neck P4
  - [-1, 3, C2f, [512]]             # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 29
  - [[-1, 11], 1, Concat, [1]]      # 30 cat SPPF P5
  - [-1, 3, C2f, [1024]]            # 31 (P5/32-large)

  - [[21, 25, 28, 31], 1, Detect, [nc]] # 32 Detect(P2, P3, P4, P5)
