# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + ECA Attention v3 (after every C2f, NOT after SPPF)
# For fair comparison experiments on VisDrone person detection
# 8 ECA blocks: after each of the 4 backbone C2f + 4 neck C2f

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, ECA, [3]]               # 3 ← after C2f P2
  - [-1, 1, Conv, [256, 3, 2]]      # 4-P3/8
  - [-1, 6, C2f, [256, True]]       # 5
  - [-1, 1, ECA, [3]]               # 6 ← after C2f P3
  - [-1, 1, Conv, [512, 3, 2]]      # 7-P4/16
  - [-1, 6, C2f, [512, True]]       # 8
  - [-1, 1, ECA, [3]]               # 9 ← after C2f P4
  - [-1, 1, Conv, [1024, 3, 2]]     # 10-P5/32
  - [-1, 3, C2f, [1024, True]]      # 11
  - [-1, 1, ECA, [3]]               # 12 ← after C2f P5
  - [-1, 1, SPPF, [1024, 5]]        # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]       # 15 cat backbone P4 (layer 9 = ECA after C2f P4)
  - [-1, 3, C2f, [512]]             # 16
  - [-1, 1, ECA, [3]]               # 17 ← after C2f neck P4-P5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]       # 19 cat backbone P3 (layer 6 = ECA after C2f P3)
  - [-1, 3, C2f, [256]]             # 20 (P3/8-small)
  - [-1, 1, ECA, [3]]               # 21 ← after C2f neck P3

  - [-1, 1, Conv, [256, 3, 2]]      # 22
  - [[-1, 17], 1, Concat, [1]]      # 23 cat head P4 (layer 17 = ECA after neck C2f P4-P5)
  - [-1, 3, C2f, [512]]             # 24 (P4/16-medium)
  - [-1, 1, ECA, [3]]               # 25 ← after C2f neck P4

  - [-1, 1, Conv, [512, 3, 2]]      # 26
  - [[-1, 13], 1, Concat, [1]]      # 27 cat head P5 (layer 13 = SPPF)
  - [-1, 3, C2f, [1024]]            # 28 (P5/32-large)
  - [-1, 1, ECA, [3]]               # 29 ← after C2f neck P5

  - [[21, 25, 29], 1, Detect, [nc]] # 30 Detect(P3, P4, P5)
