# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + SimAM Attention (2 positions: after SPPF + after P3 C2f)
# For fair comparison experiments on VisDrone person detection
# Position 1: After SPPF (layer 10) - global semantic modulation
# Position 2: After P3 C2f (layer 17) - direct small object enhancement

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 1, SimAM, [1e-4]]          # 10 ← Attention position 1

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]       # 12 cat backbone P4
  - [-1, 3, C2f, [512]]             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]       # 15 cat backbone P3
  - [-1, 3, C2f, [256]]             # 16 (P3/8-small)
  - [-1, 1, SimAM, [1e-4]]          # 17 ← Attention position 2

  - [-1, 1, Conv, [256, 3, 2]]      # 18
  - [[-1, 13], 1, Concat, [1]]      # 19 cat head P4
  - [-1, 3, C2f, [512]]             # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 21
  - [[-1, 10], 1, Concat, [1]]      # 22 cat head P5
  - [-1, 3, C2f, [1024]]            # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # 24 Detect(P3, P4, P5)
