# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-Visdrone-P2Only: Enhanced architecture for small object detection
# Optimized for Visdrone dataset with P2-P5 multi-scale detection
# Key features:
#   - P2 detection head (stride 4) for tiny objects
#   - Deeper P2 backbone for better small object features
#   - NO CBAM attention modules (baseline version)

# Parameters
nc: 10 # number of classes for Visdrone
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768] # Recommended for Visdrone
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-Visdrone backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C2f, [128, True]] # 2 (deeper P2 for small objects)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8-Visdrone head - P2 only, no CBAM
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 2], 1, Concat, [1]] # 17 cat backbone P2
  - [-1, 3, C2f, [128]] # 18 (P2/4) - No CBAM

  # Bottom-up pathway
  - [-1, 1, Conv, [128, 3, 2]] # 19
  - [[-1, 15], 1, Concat, [1]] # 20 cat head P3
  - [-1, 3, C2f, [256]] # 21 (P3/8) - No CBAM

  - [-1, 1, Conv, [256, 3, 2]] # 22
  - [[-1, 12], 1, Concat, [1]] # 23 cat head P4
  - [-1, 3, C2f, [512]] # 24 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]] # 25
  - [[-1, 9], 1, Concat, [1]] # 26 cat head P5
  - [-1, 3, C2f, [1024]] # 27 (P5/32)

  # Multi-scale detection without attention modules
  - [[18, 21, 24, 27], 1, Detect, [nc]] # 28 Detect(P2, P3, P4, P5)

