# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + EMA (Efficient Multi-Scale Attention)
# EMA blocks inserted after SPPF (backbone) and after each C2f in the Neck
# Reference: https://arxiv.org/abs/2305.13563
#
# NOTE: factor=8 ensures compatibility with all scales:
#   - YOLOv8n: P3=64, 64//8=8 > 0 ✓
#   - YOLOv8s: P3=128, 128//8=16 > 0 ✓
#   For factor=32, minimum safe channels = 32 (only fine for m/l/x at P5/P4).

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-EMA backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 1, EMA, [8]]               # 10 EMA after SPPF (factor=8)

# YOLOv8-EMA head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]       # 12 cat backbone P4
  - [-1, 3, C2f, [512]]             # 13
  - [-1, 1, EMA, [8]]               # 14 EMA after C2f

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]       # 16 cat backbone P3
  - [-1, 3, C2f, [256]]             # 17 (P3/8-small)
  - [-1, 1, EMA, [8]]               # 18 EMA after C2f

  - [-1, 1, Conv, [256, 3, 2]]      # 19
  - [[-1, 14], 1, Concat, [1]]      # 20 cat head P4
  - [-1, 3, C2f, [512]]             # 21 (P4/16-medium)
  - [-1, 1, EMA, [8]]               # 22 EMA after C2f

  - [-1, 1, Conv, [512, 3, 2]]      # 23
  - [[-1, 10], 1, Concat, [1]]      # 24 cat head P5
  - [-1, 3, C2f, [1024]]            # 25 (P5/32-large)
  - [-1, 1, EMA, [8]]               # 26 EMA after C2f

  - [[18, 22, 26], 1, Detect, [nc]] # 27 Detect(P3, P4, P5)
