# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + SE Attention v7
# P2 detection head + ATT after ALL C2f (5 backbone + 5 neck = 10 blocks)
# Best for very small object detection (VisDrone)

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, SE, [16]]               # 3 ← after C2f P2
  - [-1, 1, Conv, [256, 3, 2]]      # 4-P3/8
  - [-1, 6, C2f, [256, True]]       # 5
  - [-1, 1, SE, [16]]               # 6 ← after C2f P3
  - [-1, 1, Conv, [512, 3, 2]]      # 7-P4/16
  - [-1, 6, C2f, [512, True]]       # 8
  - [-1, 1, SE, [16]]               # 9 ← after C2f P4
  - [-1, 1, Conv, [1024, 3, 2]]     # 10-P5/32
  - [-1, 3, C2f, [1024, True]]      # 11
  - [-1, 1, SE, [16]]               # 12 ← after C2f P5
  - [-1, 1, SPPF, [1024, 5]]        # 13

head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]       # 15 cat backbone P4
  - [-1, 3, C2f, [512]]             # 16
  - [-1, 1, SE, [16]]               # 17 ← after C2f neck P4-P5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]       # 19 cat backbone P3
  - [-1, 3, C2f, [256]]             # 20
  - [-1, 1, SE, [16]]               # 21 ← after C2f neck P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22
  - [[-1, 3], 1, Concat, [1]]       # 23 cat backbone P2
  - [-1, 3, C2f, [128]]             # 24 (P2/4-tiny)
  - [-1, 1, SE, [16]]               # 25 ← after C2f neck P2

  # PAN bottom-up
  - [-1, 1, Conv, [128, 3, 2]]      # 26
  - [[-1, 21], 1, Concat, [1]]      # 27 cat neck P3
  - [-1, 3, C2f, [256]]             # 28 (P3/8-small)
  - [-1, 1, SE, [16]]               # 29 ← after C2f neck P3 output

  - [-1, 1, Conv, [256, 3, 2]]      # 30
  - [[-1, 17], 1, Concat, [1]]      # 31 cat neck P4
  - [-1, 3, C2f, [512]]             # 32 (P4/16-medium)
  - [-1, 1, SE, [16]]               # 33 ← after C2f neck P4 output

  - [-1, 1, Conv, [512, 3, 2]]      # 34
  - [[-1, 13], 1, Concat, [1]]      # 35 cat SPPF P5
  - [-1, 3, C2f, [1024]]            # 36 (P5/32-large)
  - [-1, 1, SE, [16]]               # 37 ← after C2f neck P5 output

  - [[25, 29, 33, 37], 1, Detect, [nc]] # 38 Detect(P2, P3, P4, P5)
