# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + SimAM Attention v4
# ATT after C2f at P3, P4 backbone + P3, P4 neck output (4 blocks total)
# Focus on medium-scale features, skip P2 (too early) and P5 (too coarse)

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, SimAM, [1e-4]] # 5 ← after C2f P3 backbone
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [512, True]] # 7
  - [-1, 1, SimAM, [1e-4]] # 8 ← after C2f P4 backbone
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 8], 1, Concat, [1]] # 13 cat backbone P4 (layer 8)
  - [-1, 3, C2f, [512]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 5], 1, Concat, [1]] # 16 cat backbone P3 (layer 5)
  - [-1, 3, C2f, [256]] # 17 (P3/8-small)
  - [-1, 1, SimAM, [1e-4]] # 18 ← after C2f neck P3

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 14], 1, Concat, [1]] # 20 cat head P4
  - [-1, 3, C2f, [512]] # 21 (P4/16-medium)
  - [-1, 1, SimAM, [1e-4]] # 22 ← after C2f neck P4

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 11], 1, Concat, [1]] # 24 cat head P5 (SPPF layer 11)
  - [-1, 3, C2f, [1024]] # 25 (P5/32-large)

  - [[18, 22, 25], 1, Detect, [nc]] # 26 Detect(P3, P4, P5)
