# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-Visdrone: Enhanced architecture for small object detection
# Optimized for Visdrone dataset with P2-P5 multi-scale detection
# Key features:
#   - P2 detection head (stride 4) for tiny objects
#   - CBAM attention modules for P2 and P3
#   - Enhanced Feature Pyramid with attention
#   - Deeper P2 backbone for better small object features

# Parameters
nc: 10  # number of classes for Visdrone
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]  # Recommended for Visdrone
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-Visdrone backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C2f, [128, True]]  # 2 (deeper P2 for small objects)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9

# YOLOv8-Visdrone head - Enhanced with attention
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C2f, [512]]         # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 3, C2f, [256]]         # 15 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2
  - [-1, 3, C2f, [128]]         # 18 (P2/4)
  - [-1, 1, CBAM, []]           # 19 P2 attention for tiny objects

  # Bottom-up pathway
  - [-1, 1, Conv, [128, 3, 2]]  # 20
  - [[-1, 15], 1, Concat, [1]]  # 21 cat head P3
  - [-1, 3, C2f, [256]]          # 22 (P3/8)
  - [-1, 1, CBAM, []]            # 23 P3 attention for small objects

  - [-1, 1, Conv, [256, 3, 2]]  # 24
  - [[-1, 12], 1, Concat, [1]]  # 25 cat head P4
  - [-1, 3, C2f, [512]]          # 26 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]  # 27
  - [[-1, 9], 1, Concat, [1]]   # 28 cat head P5
  - [-1, 3, C2f, [1024]]         # 29 (P5/32)

  # Multi-scale detection with attention-enhanced features
  - [[19, 23, 26, 29], 1, Detect, [nc]]  # 30 Detect(P2, P3, P4, P5)

