# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-Visdrone-BiFPN: BiFPN-inspired architecture for superior small object detection
# Highly optimized for Visdrone with cross-scale feature fusion
# Key innovations:
#   - BiFPN-style weighted bidirectional connections
#   - C2fPSA (Polarized Self-Attention) for enhanced features
#   - Multi-source feature fusion at each scale
#   - Deeper backbone for small object representation
#   - CBAM attention on critical detection layers

# Parameters
nc: 10  # Visdrone classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.30, 1024]  # More width for small objects
  s: [0.33, 0.60, 1024]  # Recommended for Visdrone
  m: [0.67, 0.85, 768]   # High accuracy
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-Visdrone-BiFPN backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 4, C2f, [128, True]]   # 2 Deeper P2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9 Global context

# YOLOv8-Visdrone-BiFPN head - BiFPN-inspired fusion
head:
  # === First top-down pathway ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]   # 11 cat P4
  - [-1, 3, C2fPSA, [512]]      # 12 PSA attention for P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]   # 14 cat P3
  - [-1, 3, C2fPSA, [256]]      # 15 PSA attention for P3
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 2], 1, Concat, [1]]   # 17 cat P2
  - [-1, 3, C2fAttn, [128]]     # 18 Enhanced P2

  # === BiFPN-style bidirectional fusion ===
  # P2 -> P3 with multi-source fusion
  - [-1, 1, Conv, [128, 3, 2]]   # 19 P2 down
  - [[-1, 15, 4], 1, Concat, [1]]  # 20 BiFPN: P2_down + P3_td + P3_backbone
  - [-1, 3, C2fPSA, [256]]       # 21 Enhanced P3_out
  
  # P3 -> P4 with multi-source fusion
  - [-1, 1, Conv, [256, 3, 2]]   # 22 P3 down
  - [[-1, 12, 6], 1, Concat, [1]]  # 23 BiFPN: P3_down + P4_td + P4_backbone
  - [-1, 3, C2fPSA, [512]]       # 24 Enhanced P4_out

  # P4 -> P5 with fusion
  - [-1, 1, Conv, [512, 3, 2]]   # 25 P4 down
  - [[-1, 9], 1, Concat, [1]]    # 26 cat P5
  - [-1, 3, C2f, [1024, True]]   # 27 P5_out

  # === Small object enhancement ===
  - [18, 1, CBAM, [128]]         # 28 CBAM on P2 for tiny objects
  - [21, 1, CBAM, [256]]         # 29 CBAM on P3 for small objects

  # Multi-scale detection with enhanced features
  - [[28, 29, 24, 27], 1, Detect, [nc]]  # 30 Detect(P2, P3, P4, P5)

