# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + SE Attention v6
# ATT after C2f in BACKBONE only (4 blocks)
# Neck remains unchanged, attention applied only in backbone feature extraction

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, SE, [16]] # 3 ← after C2f P2
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]] # 5
  - [-1, 1, SE, [16]] # 6 ← after C2f P3
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]] # 8
  - [-1, 1, SE, [16]] # 9 ← after C2f P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, SE, [16]] # 12 ← after C2f P5
  - [-1, 1, SPPF, [1024, 5]] # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 9], 1, Concat, [1]] # 15 cat backbone P4 (layer 9)
  - [-1, 3, C2f, [512]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 6], 1, Concat, [1]] # 18 cat backbone P3 (layer 6)
  - [-1, 3, C2f, [256]] # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21 cat head P4
  - [-1, 3, C2f, [512]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24 cat head P5 (SPPF layer 13)
  - [-1, 3, C2f, [1024]] # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]] # 26 Detect(P3, P4, P5)
