# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12-Visdrone: Enhanced architecture for small object detection
# Optimized for Visdrone dataset with P2-P5 multi-scale detection
# Key features:
#   - P2 detection head (stride 4) for tiny objects
#   - Enhanced Feature Pyramid with cross-scale connections
#   - CBAM attention for small object features
#   - Bidirectional feature fusion

# Parameters
nc: 10  # number of classes for Visdrone (pedestrian, people, bicycle, car, van, truck, tricycle, awning-tricycle, bus, motor)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: lightweight for fast inference
  s: [0.50, 0.50, 1024] # summary: balanced speed and accuracy
  m: [0.50, 1.00, 512]  # summary: recommended for Visdrone
  l: [1.00, 1.00, 512]  # summary: high accuracy
  x: [1.00, 1.50, 512]  # summary: maximum accuracy

# YOLO12-Visdrone backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (KEEP for small objects!)
  - [-1, 2, C3k2, [128, False, 0.25]]  # 2 - Enhanced P2 features
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-Visdrone head - Enhanced multi-scale detection
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 6], 1, Concat, [1]]  # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 4], 1, Concat, [1]]  # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]  # 14
  
  # Add P2 level for small objects
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 2], 1, Concat, [1]]  # 16 cat backbone P2
  - [-1, 2, C3k2, [128, False]]  # 17 P2 features
  - [-1, 1, CBAM, [128]]  # 18 P2 attention for small objects

  # Bottom-up pathway with cross-scale fusion
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 14], 1, Concat, [1]]  # 20 cat P3
  - [-1, 2, A2C2f, [256, False, -1]]  # 21 Enhanced P3
  - [-1, 1, CBAM, [256]]  # 22 P3 attention

  - [-1, 1, Conv, [256, 3, 2]]  # 23
  - [[-1, 11], 1, Concat, [1]]  # 24 cat P4
  - [-1, 2, A2C2f, [512, False, -1]]  # 25 Enhanced P4

  - [-1, 1, Conv, [512, 3, 2]]  # 26
  - [[-1, 8], 1, Concat, [1]]  # 27 cat P5
  - [-1, 2, C3k2, [1024, True]]  # 28 P5/32-large

  # Multi-scale detection: P2, P3, P4, P5
  - [[18, 22, 25, 28], 1, Detect, [nc]]  # 29 Detect(P2, P3, P4, P5)

